issues/7.org
#+options: toc:nil
#+latex_header: \usepackage[margin=1in]{geometry}

* Issue 7 (Multiple local nicknames)
** Description
   It is not clear whether ~package-locally-nicknamed-by-list~ should be allowed to return
   lists with duplicate entries (when there are multiple local nicknames in one package).
** Examples
   #+BEGIN_SRC common-lisp
     (defpackage #:foo
       (:use)
       (:local-nicknames (#:bar #:cl)
                         (#:baz #:cl)))
     (mapcar #'package-name (package-locally-nicknamed-by-list '#:cl))
     ; => ("FOO")  (sbcl, acl, clasp, lispworks)
     ; => ("FOO" "FOO")  (ccl, ecl, abcl)
   #+END_SRC
** Current behavior
   sbcl, acl, clasp, lispworks:
     ~package-locally-nicknamed-by-list~ never contains duplicate entries.

   ccl, abcl, ecl:
     ~package-locally-nicknamed-by-list~ might contain duplicate entries.
** Proposal NO-DUPLICATES
   ~package-locally-nicknamed-by-list~ must return a list without duplicate entries.
