export/issues/7.tex
% Created 2024-07-05 Fri 13:32
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{Gleefre}
\date{\today}
\title{PLN CDR draft: Issue 7}
\hypersetup{
 pdfauthor={Gleefre},
 pdftitle={PLN CDR draft: Issue 7},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Issue 7 (Multiple local nicknames)}
\label{sec:org0f497cd}
\subsection{Description}
\label{sec:org942f20b}
It is not clear whether \texttt{package-locally-nicknamed-by-list} should be allowed to return
lists with duplicate entries (when there are multiple local nicknames in one package).
\subsection{Examples}
\label{sec:orgee2b4f0}
\begin{verbatim}
(defpackage #:foo
  (:use)
  (:local-nicknames (#:bar #:cl)
                    (#:baz #:cl)))
(mapcar #'package-name (package-locally-nicknamed-by-list '#:cl))
; => ("FOO")  (sbcl, acl, clasp, lispworks)
; => ("FOO" "FOO")  (ccl, ecl, abcl)
\end{verbatim}
\subsection{Current behavior}
\label{sec:orgf3c62b5}
sbcl, acl, clasp, lispworks:
  \texttt{package-locally-nicknamed-by-list} never contains duplicate entries.

ccl, abcl, ecl:
  \texttt{package-locally-nicknamed-by-list} might contain duplicate entries.
\subsection{Proposal NO-DUPLICATES}
\label{sec:orgaebf5d8}
\texttt{package-locally-nicknamed-by-list} must return a list without duplicate entries.
\end{document}